/*
生成蛇形(一字形)矩阵。
输入一个整数n，然后输出一个n*n的整数矩阵。从矩阵的首个元素（第一行第一列）开始，模仿蛇的爬行轨迹，先向下方爬行，爬到矩阵的最下端时候跳到第二列的最下端然后开始向上爬行，以此类推，即保证列与列之间轨迹连续。在矩阵中的所有点的值均为当前爬行的轨迹的长度，轨迹上第一个点的值为1,。
生成这个矩阵并打印。

**
1.输出提示信息："请输入n:\n"
2.整数n的输入格式："%d"
3.输出提示信息："输出的蛇形矩阵为:\n"
3.输出矩阵的打印： "%4d" (按矩阵的行来输出，行的末尾换行)

程序运行结果示例：

示例1：
请输入n:
2↙
输出的蛇形矩阵为:
1   4
2   3

示例2：
请输入n:
3↙
输出的蛇形矩阵为:
1   6   7
2   5   8
3   4   9
*/

#include <stdio.h>

int main()
{
    int i,j,n;
    printf("请输入n:\n"); //1
    scanf("%d",&n);//1
    printf("输出的蛇形矩阵为:\n"); //1
    int a[n][n];//2
    for(i = 0;i<n;i++)
        a[i][0] = i+1;
    for(i = 1;i<n;i++){//2
        int toAdd[n];//1
        if(i%2 == 0){//2
            for(j = 0;j<n;j++){//1
                toAdd[j] = 2 * j+1;//1
            }
        }else{
            for(j = 0;j<n;j++)//1
                toAdd[j] = 2 * (n - (j+1)) + 1;//1
        }
        for(j = 0;j<n;j++){//2
            a[j][i] = a[j][i-1] + toAdd[j];//1
        }
    }

    for(i=0;i<n;i++){//1
        for(j=0;j<n;j++){//1
            printf("%4d",a[i][j]);//1
        }
        printf("\n");//1
    }
    return 0;
}

